posts/publishing-with-nikola-in-emacs/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Publishing with Nikola in Emacs | notroot</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://joseph8th.github.io/posts/publishing-with-nikola-in-emacs/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Joseph Edwards VIII">
<link rel="prev" href="../exwm-on-raspberry-pi-os-lite/" title="EXWM on Raspberry Pi OS Lite" type="text/html">
<meta property="og:site_name" content="notroot">
<meta property="og:title" content="Publishing with Nikola in Emacs">
<meta property="og:url" content="https://joseph8th.github.io/posts/publishing-with-nikola-in-emacs/">
<meta property="og:description" content="Publishing Emacs Org Mode files to GitHub Pages with Nikola is fairly straight-forward, if you're using the command-line. But if you want, as I did, to write and publish from within Emacs, then there'">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-11-12T17:25:34-05:00">
<meta property="article:tag" content="blogging">
<meta property="article:tag" content="emacs">
<meta property="article:tag" content="nikola">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">Skip to main content</a>
    
    <section class="social"><ul>
<li><a href="../../index.html" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../archive.html" title="Archives"><i class="fa fa-folder-open"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
            <li><a href="../../stories/about-me" title="About Me"><i class="fa fa-user"></i></a></li>
            <li><a href="https://github.com/joseph8th" title="My Github"><i class="fab fa-github"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Publishing with Nikola in Emacs</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2020-11-12T17:25:34-05:00" itemprop="datePublished" title="2020-11-12 17:25">2020-11-12 17:25</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Joseph Edwards VIII
            </span></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> Source</a></p>

            

            
    <div class="tags">
<h3 class="metadata-title">
<i class="fa fa-tags"></i> Tags:</h3>
        <ul itemprop="keywords" class="tags-ul">
<li><a class="tag p-category" href="../../categories/blogging/" rel="tag">blogging</a></li>
            <li><a class="tag p-category" href="../../categories/emacs/" rel="tag">emacs</a></li>
            <li><a class="tag p-category" href="../../categories/nikola/" rel="tag">nikola</a></li>
        </ul>
</div>

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Publishing Emacs Org Mode files to <a href="https://pages.github.com/">GitHub Pages</a> with <a href="https://getnikola.com/">Nikola</a> is fairly straight-forward, <a href="https://mindtoilet.github.io/posts/how-to-write-a-blog-using-nikola/">if you're using the command-line</a>. But if you want, as I did, to write and publish from within Emacs, then there's more setup involved. It's still not terribly difficult, however. I did this all today.
</p>

<p>
The final blog is going to be very vanilla, so I've included some additional resources to play with, as much for my own reference as for you, the reader's.
</p>

<div id="outline-container-org54e6456" class="outline-2">
<h2 id="org54e6456">Get Nikola Working</h2>
<div class="outline-text-2" id="text-org54e6456">
<p>
Before we start, save yourself a headache and <b>don't</b> install Nikola in a Python virtual environment. Or if you're using <a href="https://github.com/pyenv/pyenv">pyenv</a>, install it in the <code>global</code> environment. This works fine in the terminal, but we're going to be writing some extra elisp for the <code>nikola.el</code> package. I have no doubt there's a way to get this package working with virtual environments, but as of this writing, I haven't figured it out.
</p>

<p>
Next, follow the instructions in <a href="https://mindtoilet.github.io/posts/how-to-write-a-blog-using-nikola/">this excellent tutorial</a> to get all the pieces working together, and to learn the command-line way of doing things as a fallback.
</p>

<p>
The end result will be your first blog post on your GitHub Page. Now that you know it works, let's move on to setting up Emacs so you never have to leave it to write and publish.
</p>
</div>
</div>

<div id="outline-container-orgec0e351" class="outline-2">
<h2 id="orgec0e351">Install and Configure <code>nikola.el</code>
</h2>
<div class="outline-text-2" id="text-orgec0e351">
<p>
We're going to use the "simple wrapper" <code>nikola.el</code> package as a base. Follow <a href="https://gitlab.com/drymerisnothere/nikola-el">these instructions</a> to install and configure it.
</p>

<p>
We want to default to Org files, instead of HTML, so here's the <code>use-package</code> config I have in my <code>init.el</code>. Note that I've turned on <code>nikola-verbose</code> and <code>nikola-webserver-auto</code> as well as setting the default extension to <code>"org"</code>:
</p>

<div class="highlight"><pre><span></span><span class="c1">;; Nikola.el config</span>
<span class="p">(</span><span class="nf">use-package</span> <span class="nv">nikola</span>
  <span class="nv">:config</span>
  <span class="p">(</span><span class="nf">setq</span> <span class="nv">nikola-output-root-directory</span> <span class="s">"~/Dev/mine/joseph8th.github.io/"</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">setq</span> <span class="nv">nikola-verbose</span> <span class="nv">t</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">setq</span> <span class="nv">nikola-webserver-auto</span> <span class="nv">t</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">setq</span> <span class="nv">nikola-new-post-extension</span> <span class="s">"org"</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">setq</span> <span class="nv">nikola-new-page-extension</span> <span class="s">"org"</span><span class="p">))</span>
</pre></div>
</div>
</div>

<div id="outline-container-orgecc6043" class="outline-2">
<h2 id="orgecc6043">Add Wrapper for <code>github_deploy</code>
</h2>
<div class="outline-text-2" id="text-orgecc6043">
<p>
At this point, we <b>could</b> just start writing by using the <code>nikola-new-post</code> command. It will open an Org file and you can start typing, as I am right now.
</p>

<p>
The problem comes when we run <code>nikola-deploy</code>. That command basically runs <code>nikola deploy</code> in a shell, <b>but that's not the command we want to run</b>. We want to run <code>nikola github_deploy</code>, as we did on the command-line.
</p>

<p>
So you'll also need to add the following <code>nikola-github-deploy</code> function to your <code>init.el</code>, which I simply whittled down from the <code>nikola-deploy</code>:
</p>

<div class="highlight"><pre><span></span><span class="c1">;; Custom nikola-github-deploy function</span>
<span class="p">(</span><span class="nf">defun</span> <span class="nv">nikola-github-deploy</span> <span class="p">()</span>
  <span class="s">"Deploys the site to GitHub using github_deploy subcommand."</span>
  <span class="p">(</span><span class="nf">interactive</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">message</span> <span class="s">"Deploying the site to GitHub pages..."</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">async-start</span>
   <span class="o">`</span><span class="p">(</span><span class="k">lambda </span><span class="p">()</span>
      <span class="o">,</span><span class="p">(</span><span class="nf">async-inject-variables</span> <span class="s">"\\(nikola-\\)"</span><span class="p">)</span>
      <span class="p">(</span><span class="nf">setq</span> <span class="nv">output</span> <span class="nv">nil</span><span class="p">)</span>
      <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">default-directory</span> <span class="nv">nikola-output-root-directory</span><span class="p">))</span>
	<span class="p">(</span><span class="nf">run-hook-with-args</span> <span class="ss">'nikola-deploy-before-hook</span> <span class="s">""</span><span class="p">)</span>
	<span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">not </span><span class="p">(</span><span class="nf">eq</span> <span class="nv">nikola-deploy-before-hook-script</span> <span class="nv">nil</span><span class="p">))</span>
	    <span class="p">(</span><span class="nf">setq</span> <span class="nv">output</span> <span class="p">(</span><span class="nf">shell-command-to-string</span>
			  <span class="nv">nikola-deploy-before-hook-script</span><span class="p">)))</span>
	<span class="p">(</span><span class="nf">setq</span> <span class="nv">output</span> <span class="p">(</span><span class="nf">shell-command-to-string</span> <span class="p">(</span><span class="nf">concat</span> <span class="nv">nikola-command</span> <span class="s">" github_deploy"</span><span class="p">)))</span>
	<span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">not </span><span class="p">(</span><span class="nf">eq</span> <span class="nv">nikola-deploy-after-hook-script</span> <span class="nv">nil</span><span class="p">))</span>
	    <span class="p">(</span><span class="nf">setq</span> <span class="nv">output</span> <span class="p">(</span><span class="nf">shell-command-to-string</span>
			  <span class="nv">nikola-deploy-after-hook-script</span><span class="p">)))</span>
	<span class="p">(</span><span class="nf">run-hook-with-args</span> <span class="ss">'nikola-deploy-before-hook</span> <span class="s">""</span><span class="p">))</span>
      <span class="nv">output</span><span class="p">)</span>
   <span class="p">(</span><span class="k">lambda </span><span class="p">(</span><span class="nf">result</span><span class="p">)</span>
     <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nf">cl-search</span> <span class="s">"This command needs to run inside an existing Nikola site."</span>
		    <span class="nv">result</span><span class="p">)</span>
	 <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nf">eq</span> <span class="nv">nikola-verbose</span> <span class="nv">t</span><span class="p">)</span>
	     <span class="p">(</span><span class="nf">message</span> <span class="s">"Something went wrong. You may want to set nikola-verbo\</span>
<span class="s">se to t and retry it."</span><span class="p">)</span>
	   <span class="p">(</span><span class="nf">message</span> <span class="s">"Something went wrong. You may want to check the *Nikola*\</span>
<span class="s">buffer."</span><span class="p">))</span>
       <span class="p">(</span><span class="nf">message</span> <span class="s">"Site deployed correctly."</span><span class="p">))</span>
     <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nf">eq</span> <span class="nv">nikola-verbose</span> <span class="nv">t</span><span class="p">)</span>
	 <span class="p">(</span><span class="nf">save-window-excursion</span>
	   <span class="p">(</span><span class="nf">switch-to-buffer</span> <span class="s">"*Nikola*"</span><span class="p">)</span>
	   <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">inhibit-read-only</span> <span class="nv">t</span><span class="p">))</span>
	     <span class="p">(</span><span class="nf">insert</span> <span class="nv">result</span><span class="p">)))))))</span>
</pre></div>
</div>
</div>

<div id="outline-container-org17afb92" class="outline-2">
<h2 id="org17afb92">Write and Publish from Emacs</h2>
<div class="outline-text-2" id="text-org17afb92">
<p>
Now you can evaluate the <code>init.el</code> buffer, or restart Emacs, and do <code>nikola-new-post</code>. Emacs will ask for the title, and create the post files, and open a buffer to write a new post.
</p>

<p>
You'll immediately notice that, unlike the command-line experience you had earlier, the meta is not included at the top of the new buffer that opens. If your new post is named <code>publishing-with-nikola-in-emacs.org</code>, then the meta will be in the same directory, and named <code>publishing-with-nikola-in-emacs.meta</code>. You will have to edit it separately.
</p>

<pre class="example">
.. title: Publishing with Nikola in Emacs
.. slug: publishing-with-nikola-in-emacs
.. date: 2020-11-12 17:25:34
.. tags: emacs,nikola,blogging
</pre>

<p>
When you're done writing your amazing blog post, just save it.
</p>

<p>
Now try previewing your new post by running <code>nikola-webserver-start</code>. Notice that that this is a <b>live preview</b>, and if you make changes and save again, you will see them when you refresh your browser.
</p>

<p>
Next, run <code>nikola-build</code> to make sure everything is rebuilt and updated.
</p>

<p>
When you're happy with the final result, then just publish it with <code>nikola-github-deploy</code>.
</p>
</div>
</div>

<div id="outline-container-org48e3f87" class="outline-2">
<h2 id="org48e3f87">Additional Resources</h2>
<div class="outline-text-2" id="text-org48e3f87">
<ul class="org-ul">
<li>
<b>Syntax Highlighting</b>: If you included source blocks in your Org file, you probably noticed that syntax highlighting isn't supported. I'm going to look at <a href="https://github.com/redguardtoo/org2nikola">org2nikola</a> package to add <code>highlight.js</code> support at some point.</li>
<li>
<b>Themes and Templates</b>: Since I'm almost as new at this as you, the reader, are, I've got jack. I'm going to look into <a href="https://getnikola.com/creating-a-theme.html">Nikola theme creation</a> at some point in the future, and if suddenly this blog looks better, it's because I learned something. I'll probably blog about it!</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../exwm-on-raspberry-pi-os-lite/" rel="prev" title="EXWM on Raspberry Pi OS Lite">Previous post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2020         <a href="mailto:jedwards8th@gmail.com">Joseph Edwards VIII</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
